/*******************************************************************************
*                                                                              *
*                                  Циклы. №3.                                  *
*    Найти сумму квадратов первых ста чисел.                                   *
*                                                                              *
*******************************************************************************/

public class C3 {
   public static void main(String[] args) {
     long S=1;
     for(byte i=2; i<=100; i++) S+=i*i;
     System.out.println(S);
   }
}