/*******************************************************************************
*                                                                              *
*                                 Циклы. №6.                                   *
*    Вывести на экран таблицу соответствий между символами и их численными     *
*  обозначениями в памяти компьютера.                                          *
*                                                                              *
*******************************************************************************/

public class C6 {
  public static void main(String[] args) {
    for(char c=' '; c<='z'; c++) {
      System.out.print("'" + c + "'=" + (byte)c + '\t');
    }
    System.out.println();
  }
}